app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
INSERT INTO "comments" ("user", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user", "test"], ["body", "testtetst"], ["post_id", 1], ["created_at", "2016-08-17 14:38:54.795671"], ["updated_at", "2016-08-17 14:38:54.795671"]]