app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Testtest"], ["text", "testtest"], ["created_at", "2016-08-17 14:37:55.579405"], ["updated_at", "2016-08-17 14:37:55.579405"]]

	def update
		@post = Post.find(params[:id])

		if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?